{
  "full_about": "Hello there! My name is Baraa Al-Masri and I like building software, most likely web apps, some of the stuff I build are opensource, here's a list of my [projects](/projects) that saw the light of day.\n\nMy interst in computers started when I was a kid when my computer broke down and I was like, hell I should be able to fix that, and so I've completed this dark path, where I was to fix computers and phones of my family's.\n\nI started my Linux journey when I was 13 where we had a computer course, and in the OS section Ubuntu was mentioned, I thought well I should try that on my computer, one thing led to another and I use Gentoo now :)\n\nI'm currently studying Software Engineering in my collage, because I thought collage would give me what I wanted, but it wasn't enough for me so I started building useless daily apps, till I found  myself in web development, and so I stayed in that area.\n\nAfter trying different languages and frameworks, two of them really hooked me in, Go was the best programming language I've ever used concidering it's simplicity, cleanliness, and rich standard library, so I kept using it for backend and system applications, I've tried a lot of frontend frameworks like, Go templates, Vue.js, React.js, Next.js and the GOAT SvelteKit which became my favourite frontend framework because of its clean and light architecture for an SSR frontend framework.\n\nI started my professional work at ProgressSoft as a Java SpringBoot developer, before that I used to build web apps for my university students, and I used to work as a freelancer since I was 2nd year in collage, most of the stuff I made were proprietary software, so here's that.",
  "brief_about": "I'm a software developer specializing in web development in various stacks, and a fresh embedded rustacean 🦀　\nI pay rent by writing TypeScript full stack web apps @ Jordan Open Source Association.　\nAnd in my free time I write more code, blog, and slack watching YT shorts.",
  "blog_intro": "This is a place where I vent, write solutions for crappy experiences I make, and other stuff...",
  "technologies": [
    "Go",
    "Rust",
    "TypeScript",
    "Java",
    "Elixir",
    "Bash",
    "SvelteKit",
    "Nuxt",
    "Yew",
    "SpringBoot",
    "Phoenix",
    "Linux",
    "Google Cloud Platform",
    "Embedded Programming",
    "Vim",
    "LaTex",
    "Git",
    "Nginx"
  ]
}
